In [2]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01  1.367189 -0.569098 -0.046871  0.750499
2025-01-02  1.624044  0.616451 -1.035396 -0.014416
2025-01-03 -0.555120  0.496390  0.144627 -0.864931
2025-01-04  1.618550 -0.842211  0.867952 -0.406806
2025-01-05  0.701444  1.310812 -0.315725  1.263694
2025-01-06  0.690216 -1.032226  0.823436 -0.648299

In [3]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01  1.367189 -0.569098 -0.046871  0.750499  1.0
2025-01-02  1.624044  0.616451 -1.035396 -0.014416  1.0
2025-01-03 -0.555120  0.496390  0.144627 -0.864931  NaN
2025-01-04  1.618550 -0.842211  0.867952 -0.406806  NaN

In [4]:
df1.dropna()

                   A         B         C         D    E
2025-01-01  1.367189 -0.569098 -0.046871  0.750499  1.0
2025-01-02  1.624044  0.616451 -1.035396 -0.014416  1.0

In [5]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01  1.367189 -0.569098 -0.046871  0.750499  1.0
2025-01-02  1.624044  0.616451 -1.035396 -0.014416  1.0
2025-01-03 -0.555120  0.496390  0.144627 -0.864931  5.0
2025-01-04  1.618550 -0.842211  0.867952 -0.406806  5.0

In [6]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [7]:
df

                   A         B         C         D
2025-01-01  1.367189 -0.569098 -0.046871  0.750499
2025-01-02  1.624044  0.616451 -1.035396 -0.014416
2025-01-03 -0.555120  0.496390  0.144627 -0.864931
2025-01-04  1.618550 -0.842211  0.867952 -0.406806
2025-01-05  0.701444  1.310812 -0.315725  1.263694
2025-01-06  0.690216 -1.032226  0.823436 -0.648299

In [8]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -1.555120 -0.503610 -0.855373 -1.864931
2025-01-04 -1.381450 -3.842211 -2.132048 -3.406806
2025-01-05 -0.298556  0.310812 -1.315725  0.263694
2025-01-06       NaN       NaN       NaN       NaN

In [9]:
df

                   A         B         C         D
2025-01-01  1.367189 -0.569098 -0.046871  0.750499
2025-01-02  1.624044  0.616451 -1.035396 -0.014416
2025-01-03 -0.555120  0.496390  0.144627 -0.864931
2025-01-04  1.618550 -0.842211  0.867952 -0.406806
2025-01-05  0.701444  1.310812 -0.315725  1.263694
2025-01-06  0.690216 -1.032226  0.823436 -0.648299

In [10]:
df.A.transform(lambda x: x*100)

2025-01-01    136.718865
2025-01-02    162.404446
2025-01-03    -55.511963
2025-01-04    161.854979
2025-01-05     70.144385
2025-01-06     69.021637
Freq: D, Name: A, dtype: float64

In [11]:
df.agg(lambda x: np.mean(x) * 100)

A    90.772058
B    -0.331380
C     7.300386
D     1.329014
dtype: float64

In [12]:
pd.concat([df, df]).value_counts()

A          B          C          D
-0.555120   0.496390   0.144627  -0.864931    2
 0.690216  -1.032226   0.823436  -0.648299    2
 0.701444   1.310812  -0.315725   1.263694    2
 1.367189  -0.569098  -0.046871   0.750499    2
 1.618550  -0.842211   0.867952  -0.406806    2
 1.624044   0.616451  -1.035396  -0.014416    2
Name: count, dtype: int64

In [13]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [14]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [15]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01  1.367189 -0.569098 -0.046871  0.750499
2025-01-02  1.624044  0.616451 -1.035396 -0.014416
2025-01-03 -0.555120  0.496390  0.144627 -0.864931
2025-01-04  1.618550 -0.842211  0.867952 -0.406806
2025-01-05  0.701444  1.310812 -0.315725  1.263694
2025-01-06  0.690216 -1.032226  0.823436 -0.648299

In [16]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,1.367189,-0.569098,-0.046871,0.750499,1.367189,-0.569098,-0.046871,0.750499
2025-01-02,1.624044,0.616451,-1.035396,-0.014416,1.624044,0.616451,-1.035396,-0.014416
2025-01-03,-0.555120,0.496390,0.144627,-0.864931,-0.555120,0.496390,0.144627,-0.864931
2025-01-04,1.618550,-0.842211,0.867952,-0.406806,1.618550,-0.842211,0.867952,-0.406806
2025-01-05,0.701444,1.310812,-0.315725,1.263694,0.701444,1.310812,-0.315725,1.263694
2025-01-06,0.690216,-1.032226,0.823436,-0.648299,0.690216,-1.032226,0.823436,-0.648299

In [17]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [18]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [20]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [21]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [22]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [23]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [24]:
data = pd.Series(np.random.uniform(size=9), index=[["a", "a", "a", "b", "b", "c", "c", "d", "d"],  [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.091594
   2    0.890909
   3    0.943375
b  1    0.994595
   3    0.690726
c  1    0.319030
   2    0.615510
d  2    0.523375
   3    0.277380
dtype: float64

In [25]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [26]:
data.b

1    0.994595
3    0.690726
dtype: float64

In [27]:
data

a  1    0.091594
   2    0.890909
   3    0.943375
b  1    0.994595
   3    0.690726
c  1    0.319030
   2    0.615510
d  2    0.523375
   3    0.277380
dtype: float64

In [28]:
data.unstack()

          1         2         3
a  0.091594  0.890909  0.943375
b  0.994595       NaN  0.690726
c  0.319030  0.615510       NaN
d       NaN  0.523375  0.277380

In [29]:
df1 = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"], "data1": pd.Series(range(6), dtype="Int64")})

df2 = pd.DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": pd.Series(range(5), dtype="Int64")})

df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [30]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [31]:
df1.merge(df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [33]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [34]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [35]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [37]:
df1.set_index('key').join(df2.set_index('key'))

     data1  data2
key
b        0      1
b        0      3
b        1      1
b        1      3
a        2      0
a        2      2
c        3   <NA>
a        4      0
a        4      2
b        5      1
b        5      3